# STEP4 : Creating Facts & Dimensions
Start by connecting to the database by running the cells below. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 and 2, then skip to the second cell.

In [3]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [2]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

#### Create the first dimension table
TODO: Create the dimDate dimension table with the fields and data types shown in the ERD above.

In [8]:
%%sql
DROP TABLE dimDate CASCADE

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [9]:
%%sql
CREATE TABLE dimDate
    (
      date_key integer NOT NULL PRIMARY KEY,
        date date NOT NULL,
        year smallint NOT NULL,
        quarter smallint NOT NULL,
        month smallint NOT NULL,
        day smallint NOT NULL,
        week smallint NOT NULL,
        is_weekend boolean
    );

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

To check your work, run the following query to see a table with the field names and data types. The output should match the table below.

In [10]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'dimdate'

 * postgresql://student:***@127.0.0.1:5432/pagila
8 rows affected.

[('date_key', 'integer'),
 ('date', 'date'),
 ('year', 'smallint'),
 ('quarter', 'smallint'),
 ('month', 'smallint'),
 ('day', 'smallint'),
 ('week', 'smallint'),
 ('is_weekend', 'boolean')]

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>column_name</th>
        <th>data_type</th>
    </tr>
    <tr>
        <td>date_key</td>
        <td>integer</td>
    </tr>
    <tr>
        <td>date</td>
        <td>date</td>
    </tr>
    <tr>
        <td>year</td>
        <td>smallint</td>
    </tr>
    <tr>
        <td>quarter</td>
        <td>smallint</td>
    </tr>
    <tr>
        <td>month</td>
        <td>smallint</td>
    </tr>
    <tr>
        <td>day</td>
        <td>smallint</td>
    </tr>
    <tr>
        <td>week</td>
        <td>smallint</td>
    </tr>
    <tr>
        <td>is_weekend</td>
        <td>boolean</td>
    </tr>
</tbody></table></div>

Run the cell below to create the rest of the dimension tables.

In [16]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [13]:
%%sql
DROP TABLE dimCustomer CASCADE;
DROP TABLE dimMovie CASCADE;
DROP TABLE dimStore CASCADE;

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.
Done.
Done.

[]

In [18]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT  c.customer_id as customer_key,
        c.customer_id,
        c.first_name,
        c.last_name,
        c.email,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        postal_code,
        a.phone,
        c.active,
        c.create_date,
       now()         AS start_date,
       now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

In [19]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, rental_duration, length, rating, special_features)
SELECT 
    f.film_id as movie_key,
    f.film_id,
    f.title, 
    f.description,
    f.release_year,
    l.name as language,
    orig_lang.name AS original_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [20]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT
    s.store_id as store_key,
    s.store_id,
    a.address,
    a.address2,
    a.district,
    c.city,
    co.country,
    a.postal_code,
    st.first_name as manager_first_name,
    st.last_name  as manager_last_name,
    now() as start_date,
    now() as end_date
FROM store s
JOIN staff st     ON    (s.manager_staff_id = st.staff_id)
JOIN address a    ON    (s.address_id = a.address_id)
JOIN city c       ON    (a.city_id = c.city_id)
JOIN country co   ON    (c.country_id = co.country_id)

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

#### Create the fact table
TODO: Create the factSales table with the fields and data types shown in the ERD above. 

**Note on REFERENCES constraints:**<br> 
The demo video does not cover the REFERENCES constraint. When building a fact table, you use the REFERENCES constrain to identify which table and column a foreign key is connected to. This ensures that the fact table does not refer to items that do not appear in the respective dimension tables. You can read more [here](https://www.postgresql.org/docs/9.2/ddl-constraints.html). Here's an example of the syntax on a different schema:

```
CREATE TABLE orders (
    order_id integer PRIMARY KEY,
    product_no integer REFERENCES products (product_no),
    quantity integer
);
```

In [21]:
%%sql
DROP TABLE IF EXISTS factSales;
CREATE TABLE factSales
    (
        sales_key SERIAL PRIMARY KEY,
        date_key integer REFERENCES dimDate (date_key),
        customer_key integer REFERENCES dimCustomer (customer_key),
        movie_key integer REFERENCES dimMovie (movie_key),
        store_key integer REFERENCES dimStore (store_key),
        sales_amount numeric
    );

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.
Done.

[]

To check your work, run the following query to see a table with the field names and data types. The output should match the table below.

In [ ]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'factsales'

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>column_name</th>
        <th>data_type</th>
    </tr>
    <tr>
        <td>sales_key</td>
        <td>integer</td>
    </tr>
    <tr>
        <td>date_key</td>
        <td>integer</td>
    </tr>
    <tr>
        <td>customer_key</td>
        <td>integer</td>
    </tr>
    <tr>
        <td>movie_key</td>
        <td>integer</td>
    </tr>
    <tr>
        <td>store_key</td>
        <td>integer</td>
    </tr>
    <tr>
        <td>sales_amount</td>
        <td>numeric</td>
    </tr>
</tbody></table></div>

If you need to delete the table and start over, use the DROP TABLE command: `DROP TABLE <table_name>`

In [22]:
%%sql
INSERT INTO factSales (date_key, customer_key, movie_key, store_key, 
                       sales_amount)
SELECT 
        TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,
        p.customer_id  as customer_key,
        i.film_id as movie_key,
        i.store_id as store_key,
        p.amount as sales_amount
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
32098 rows affected.

[]

In [23]:
%%sql
select * from factSales limit 4

 * postgresql://student:***@127.0.0.1:5432/pagila
4 rows affected.

[(1, 20170124, 269, 870, 2, Decimal('1.99')),
 (2, 20170125, 269, 651, 1, Decimal('0.99')),
 (3, 20170128, 269, 818, 1, Decimal('6.99')),
 (4, 20170129, 269, 249, 2, Decimal('0.99'))]

In [24]:
%%sql
select * from payment limit 1

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [25]:
%%sql
select * from rental limit 1

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [26]:
%%sql
select * from inventory limit 1

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]